Repository: mishaqq/alias
Catalog: lib/l10n/app_*.arb
Languages: uk

# appTitle
source: Alias
uk: Аліас

# languageTitle
source: English
uk: Українською

# continueButton
source: Continue
uk: Продовжити

# newGameButton
source: New Game
uk: Нова гра

# rulesButton
source: Rules
uk: Правила

# gameRules
source: 1. Teams take turns playing. A minimum of two players in each team. 2. One player must explain words to their team. The other team members guess. 3. You are not allowed to use any part of the word when explaining, nor words with the same root. For example, you cannot explain the word 'banker' as 'a person who works in a bank', because 'bank' and 'banker' share the same root. Words cannot be explained in foreign languages unless the players agree on this before the game starts. 4. The number of correctly guessed words equals the number of points. Mistakes and unclear words will deduct points. 5. If 'Last word for all' is enabled, the word at the end of the time can be guessed by any team. 6. A team wins when it earns enough points to win (defined in the settings).
uk: 1. Команди грають по черзі. Мінімум два гравця в кожній. 2. Один гравець має пояснювати слова для своєї команди. Інші члени команди вгадують. 3. Ви не маєте права використовувати будь-яку частину слова, коли ви пояснюєте, а також слова з одним коренем. Наприклад слово “автобус” не можна пояснити як “автомобільний транспортний засіб”. Ви можете сказати “маршрутний транспортний засіб”. Ви не можете пояснити слово “банкір” як “людина, яка працює в банку”, тому що слова “банк” та “банкір” мають спільний корінь. Слова не можна пояснювати іноземними мовами, якщо про це гравці не домовилися перед початком гри. 4. Кількість вгаданих слів відповідає кількості пунктів. Зроблені помилки і незрозумілі слова забирають пункти. 5. Якщо ввімкнене “Останнє слово для всіх”, то слово на момент закінчення часу в раунді може вгадувати будь-яка команда. 6. Команда перемагає коли набирає достатню кількість пунктів для перемоги (визначається в налаштуваннях). Навіть якщо якась команда набирає достатню кількість балів для перемоги, гра продовжується поки всі інші команди не закінчать теперішній раунд.

# words
source: Sets
uk: Слова

# settingsTitle
source: Settings
uk: Налаштування

# durationTitle
source: Round duration:
uk: Тривалість раунду:

# wordsToWinTitle
source: Words to win:
uk: Слів до перемоги:

# lastWordTitle
source: Last word for all:
uk: Останнє слово для всіх:

# backButton
source: Back
uk: Назад

# acceptButton
source: Accept
uk: Перейняти

# teamsTitle
source: Teams
uk: Команди

# addTeamButton
source: Add Team
uk: Додати команду

# nextRoundButton
source: Next Round
uk: Наступний раунд

# currentTurn
source: Now:
uk: Зараз:

# whoGuessed
source: Who is so smart?
uk: Хто такий розумний?

source: Nobody
uk: Ніхто

source: Next
uk: Далі

# oneWinner
source: won!
uk: перемогли!

# twoWinners
source: won, it's a draw!
uk: перемогли, це нічия!

# moreThenTwoWinners
source: Everyone won, it's a draw!
uk: Всі перемогли, це нічия!

# leaveGame
source: Leave
uk: Вийти

source: No
uk: Ні

# leaveGameTitle
source: Quit this game?
uk: Вийти з цієї гри?

# catPopup
source: Swipe cards to change language.
uk: Свайпни картки щоб змінити мову

# wordsAmount
source: Words
uk: Слів

# nothingSelected
source: Well, go ahead and choose something...
uk: Та вибери ти хоч щось...

# emptySets
source: Swipe or start the new game...
uk: Тут тільки нову гру починати...

source: Word for all
uk: Слово для всіх

source: Basic rules
uk: Базові правила

source: Last word for all
uk: Останнє слово для всіх

# isNoMinusPoints
source: Minus for skipping:
uk: Мінус за скіп слів:

# lastWordRools
source: 1. At the end of each round, when the time is up, the word on the last card can be guessed by any team. 2. The explainer must clearly and loudly explain the last word to all players. 3. After a team guesses the last word, you need to click on that team in the last word menu to assign them points for the last word. 4. At the end of the round, you can always change which team gets the points for the last word.
uk: 1. В кінці кожного раунду, коли час вийшов, слово на останній картці може відгадувати кожна команда. 2. Той хто пояснює, має чітко і голосно пояснювати останнє слово всім гравцям. 3. Після того як якась команда відгадала останнє слово, треба натиснути на неї у меню останнього слова, щоб зарахувати їй бали за останнє слово. 4. В кінці раунду можна завжди змінити кому зараховуються бали за останнє слово.

# scoreCountingTittle
source: Calculation of points
uk: Підрахунок балів

# scoreCountingBody
source: 1. Tap on the words in the list to toggle their status between “guessed” and “not guessed”. 2. If the “Last Word for Everyone” mode is enabled, you can change which team receives the points for the last word by tapping on it. 3. If the “Minus for skipping” feature is activated, each skipped word deducts one point, but the total score for the round cannot drop below 0.
uk: 1. Натискайте на слова у списку, щоб змінювати їхній статус між “вгадано” та “не вгадано”. 2. Якщо увімкнено режим “Останнє слово для всіх”, можна змінити кому зараховуються бали за останнє слово, натиснувши на нього. 3. Якщо активовано “Мінус пункти за свайп”, кожне пропущене слово знімає один бал, але кількість балів за раунд не може впасти нижче 0.

# gameFlowTittle
source: Game flow
uk: Хід гри

# gameFlowBody
source: 1. The current team's picture is highlighted with a black circle, and the bottom of the screen displays “Now: ” followed by the team's name. 2. Even if a team scores enough points to win, they will not be declared the winner until all teams have played one full round. 3. If more than one team scores enough points to win, the team with the highest score will be declared the winner.
uk: 1. Картинка команди, яка зараз грає виділена чорним кружечком і знизу екрану написано “Зараз: ” + її назва. 2. Навіть якщо якась команда набрала достатню для перемоги кількість балів, вона не переможе доки всі команди не зіграють одне повне коло. 3. Якщо більше ніж одна команда набрала достатню для перемоги кількість балів, переможе та, у якої найбільша кількість балів.
